{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"mask_value": -1, "name": "masking_1", "batch_input_shape": [null, 3, 13], "dtype": "float32", "trainable": true}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "name": "lstm_1", "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "recurrent_dropout": 0.0, "dtype": "float32", "unroll": false, "use_bias": true, "trainable": true, "return_sequences": false, "units": 32, "unit_forget_bias": true, "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "batch_input_shape": [null, 3, 13], "return_state": false, "implementation": 1, "recurrent_constraint": null, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "batch_input_shape": [null, 32], "dtype": "float32", "trainable": true, "units": 7, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}], "keras_version": "2.1.6", "backend": "tensorflow"}